In [3]:
# design a circle
from turtle import *
pensize(10)
pencolor("yellow")
fillcolor("skyblue")
begin_fill()
circle(50)
end_fill()

In [6]:
# design a tangent circle

from turtle import *
pensize(5)
pencolor("gray")
fillcolor("orange")
for i in range(100):
    begin_fill()
    circle(i*10)
    end_fill()

Terminator:

In [7]:
# Design a spiral circle

from turtle import *
pensize(3)
pencolor("pink")
for i in range(100):
    circle(10+i,45)

In [2]:
# Design olympics logo

from turtle import *
pensize(6)
r1 = ["skyblue","black","red"]
for i in range(3):
    penup()
    pencolor(r1[i%3])
    goto(i*100,0)
    pendown()
    circle(45)
r2 = ["","yellow","","green"]
for i in range(1,4,2):
    penup()
    pencolor(r2[i])
    goto(i*55,-55)
    pendown()
    circle(45)

## Idiomatic Python
- Transformation code into beautiful ,Idiomatic Python
- Replaces tarditional index manipulation with python code looping ididoms

In [3]:
# Looping over a range of number
for i in [0,1,2,3,4,5]:
    print(i ** 2,end=" ")
    
print()

#pythinic-way
for i in range(6):
    print(i ** 2,end=" ")

0 1 4 9 16 25
0 1 4 9 16 25

In [4]:
# Looping over the collection(list)

li=[1,2,3,4,5]
for i in range(len(li)):
    print(li[i],end=" ")
print()

# Pythinic way
for i in li:
    print(i,end=" ")

1 2 3 4 5
1 2 3 4 5

In [3]:
# Looping from backwards
li = [1,2,3,4,5]
for i in range(len(li)-1,-1,-1):
    print(li[i],end=" ")
    
print()
# Pythonic way
for i in reversed(li):
    print(i,end=" ")

5 4 3 2 1
5 4 3 2 1

In [6]:
# Looping over the collection over index
li=[1,2,3,4,5]
for i in range(len(li)):
    print(i,"-->",li[i])

print()
# Pythonic way    
for i,a in enumerate(li):
    print(i,"-->",a)

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

In [10]:
# Looping over 2 collections
li = [1,2,3,4,5]
a = [1,2,3,4,5,6,7,8]
n=min(len(li),len(a))
for i in range(n):
    print(li[i]," ",a[i])
    
print()
# Pythonic way
for i,a in zip(li,a):
    print(i," ",a)

1   1
2   2
3   3
4   4
5   5

1   1
2   2
3   3
4   4
5   5

In [12]:
# Looping in sorted order
li = [0,6,2,8,3]
for i in sorted(li):
    print(i,end=" ")
    
print()
for i in sorted(li,reverse=True):
    print(i,end=" ")

0 2 3 6 8
8 6 3 2 0

In [16]:
# Dictionary 
d = {"Name":"gitam","Emailid":"wertyu.com","Address":"vizag"}
for k in d:
    print(k,end=" ")

Name Emailid Address

In [18]:
for k in d.keys():
    if k.startswith("A"):
        del d[k]
print(d)

{'Name': 'gitam', 'Emailid': 'wertyu.com'}

In [19]:
for k in d.values():
    print(k,end=" ")

gitam wertyu.com

## List Comprehensions

In [23]:
li=[]
for i in range(10):
    a=i ** 2
    li.append(a)

print(sum(li))
print()
# Pythonic way
print(sum(i**2 for i in range(10)))

285

285

In [26]:
li=[]
for i in range(10):
    a=i ** 2
    li.append(a)
print(li)

print()
ct = [i ** 2 for i in range(10)]
print(ct)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

## Lambda Functions
- Annonymous functions means funtion without a name
- Any lambda function in python will be defined with keyword lambda
- syntax : lambda arg:expression

In [3]:
a = lambda x : x*x
print(a(10))

100

### Use of lambda with filter

In [6]:
def filterList(li):
    a=[]
    for i in li:
        if i % 2 == 0:
            a.append(i)
    return a

li=[1,2,3,4,5,6,7,8]
filterList(li)

[2, 4, 6, 8]

In [7]:
li = [1,2,3,4,5,6,7,8]
lam=list(filter(lambda x : (x % 2==0),li))
print(lam)

[2, 4, 6, 8]

### Lambda with map()
- map() function in python takes in a function and list as argument

- map() function returns a list of the results after applying the given function to each item of a given iterable (list, tuple etc.)

In [8]:
def squareList(li):
    a=[]
    for i in li:
        a.append(i*2)
    return a

squareList(li)

[2, 4, 6, 8, 10, 12, 14, 16]

In [9]:
li= [1,2,3,4,5,6,7,8]
ele=list(map(lambda x : x*2,li))
print(ele)

[2, 4, 6, 8, 10, 12, 14, 16]

### Lambda with reduce()

- The reduce(fun,seq) function is used to apply a particular function passed in its argument to all of the list elements mentioned in the sequence passed along.This function is defined in “functools” module.

In [11]:
def sumList(li):
    s = 0
    for i in li:
        s +=i
    return s

li= [1,2,3,4,5,6,7,8]
sumList(li)

36

In [12]:
li= [1,2,3,4,5,6,7,8]
from functools import reduce
s = reduce((lambda x,y : x+y),li)
print(s)

36

### Standard Packages
### Pandas , Numpy and Matplotlib

### Pandas
#### Use Cases
- Data cleaning
- Data Transformation
- Data analysis
####  Notations
- Series
- DataFrames

In [2]:
import pandas as pd
internal1 = {"s1":35,"s2":38,"s3":40}
internal2 = {"s1":20,"s2":28,"s3":25}
inte3 = [1,2,3,4,5]
internal1 = pd.Series(internal1)
internal2 = pd.Series(internal2)
inte3 = pd.Series(inte3)
print(internal1)
print(type(internal1))
print(internal2)
print(inte3)

s1    35
s2    38
s3    40
dtype: int64
<class 'pandas.core.series.Series'>
s1    20
s2    28
s3    25
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
final = {"internal1":internal1,"internal2":internal2}
final = pd.DataFrame(final)
print(final)
print(type(final))

    internal1  internal2
s1         35         20
s2         38         28
s3         40         25
<class 'pandas.core.frame.DataFrame'>

In [6]:
final.columns  # Returns the names of the columns

Index(['internal1', 'internal2'], dtype='object')

In [7]:
final.values   # Returns all row vaalues in 2-D array

array([[35, 20],
       [38, 28],
       [40, 25]], dtype=int64)

In [8]:
final.values[1]   # Represents the row index

array([38, 28], dtype=int64)

In [9]:
final.values[2][0] = 350   # Updates the data frame value
final.values[0] = 0
final.values

array([[  0,   0],
       [ 38,  28],
       [350,  25]], dtype=int64)

In [10]:
for row in final.values:
    print("Internal -1 ",row[0],"  internal -2 ",row[1])

Internal -1  0   internal -2  0
Internal -1  38   internal -2  28
Internal -1  350   internal -2  25

In [12]:
final.loc["s4"]=[20,18]   # Insert the new records in the data frame
final

    internal1  internal2
s1        100        200
s2         38         28
s3        350         25
s4         20         18

In [13]:
final.values[0] = [100,200]
final

    internal1  internal2
s1        100        200
s2         38         28
s3        350         25
s4         20         18

### Read csv files
        - to read csv file from the local computer use read_csv()

In [3]:
filepath = "C2ImportCalEventSample.csv"
def readCsvData(filepath):
    return pd.read_csv(filepath)
readCsvData(filepath)

,Start Date,Start Time,End Date,End Time,Event Title,All Day Event,No End Time,Event Description,Contact,Contact Email,Contact Phone,Location,Category,Mandatory,Registration,Maximum,Last Date To Register
0,9/5/2011,3:00:00 PM,9/5/2011,NaN,Social Studies Dept. Meeting,N,Y,Department meeting,Chris Gallagher,cgallagher@schoolwires.com,814-555-5179,High School,2,N,N,25,9/2/2011
1,9/5/2011,6:00:00 PM,9/5/2011,8:00:00 PM,Curriculum Meeting,N,N,Curriculum Meeting,Chris Gallagher,cgallagher@schoolwires.com,814-555-5179,High School,2,N,N,25,9/2/2011

In [4]:
filepath = "Income.csv"
def readCsvData(filepath):
    return pd.read_csv(filepath)
readCsvData(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [49]:
# Extract income of all states in year 2013
# Alabama : 41381

df = readCsvData("Income.csv")
for row in df.values:
    print(row[1]," : ",row[-1])

Alabama  :  41381
Alaska  :  61137
Arizona  :  50602
Arkansas  :  39919
California  :  57528

In [26]:
print(df.values)

[['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
  41381]
 ['04000US02' 'Alaska' 55891 56418 62993 63989 61604 57848 57431 63648
  61137]
 ['04000US04' 'Arizona' 45245 46657 62993 46914 45739 46896 48621 47044
  50602]
 ['04000US05' 'Arkansas' 36658 37057 40795 39586 36538 38587 41302 39018
  39919]
 ['04000US06' 'California' 51755 55319 55734 57014 56134 54283 53367
  57020 57528]]

In [31]:
# Average income of california
def avgOfState():
    s=0
    for i in range(2,11):
        s +=df.values[4][i]
    return s// len(df.values[4][2:])

avgOfState()

55350

In [32]:
# Function which displays column names in the list
def printColumns(df):
    li = []
    columns = df.columns
    for i in columns:
        li.append(i)
    return(li)

printColumns(df)

['GEOID',
 'State',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013']

In [51]:
filepath = "data.csv"
def readCsvData(filepath):
    return pd.read_csv(filepath)
readCsvData(filepath)

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
5         1985      25   1218      79   1337      78    H      0
6         1985      25   1228      64   1226      44    N      0
7         1985      25   1242      58   1268      56    N      0
8         1985      25   1260      98   1133      80    H      0
9         1985      25   1305      97   1424      89    H      0
10        1985      25   1307     103   1288      71    H      0
11        1985      25   1344      75   1438      71    N      0
12        1985      25   1374      91   1411      72    H      0
13        1985      25   1412      70   1397      65    N      0
14        1985      25   1417      87   1225      58    H      0
15        1985      26   1116      65   1368      62    H      0
16        1985      26   1120      92   1391      50    H      0
17        1985      26   1135      65   1306      60    A      0
18        1985      26   1143      58   1388      53    H      0
19        1985      26   1153      50   1184      48    H      0
20        1985      26   1165      47   1159      40    A      0
21        1985      26   1171      55   1216      52    H      0
22        1985      26   1173      76   1134      56    H      0
23        1985      26   1177      59   1296      58    H      0
24        1985      26   1193      79   1265      76    A      0
25        1985      26   1196     106   1416      55    H      0
26        1985      26   1206      95   1137      77    H      0
27        1985      26   1210      79   1149      66    H      0
28        1985      26   1211      64   1102      59    A      0
29        1985      26   1234      76   1114      47    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145259    2016     130   1452      69   1328      67    N      0
145260    2016     131   1114      72   1418      65    N      0
145261    2016     131   1138      64   1103      61    N      0
145262    2016     131   1163      77   1396      62    N      0
145263    2016     131   1167      57   1308      54    N      0
145264    2016     131   1201      68   1361      63    N      0
145265    2016     131   1214      81   1354      69    N      0
145266    2016     131   1218      64   1253      60    N      0
145267    2016     131   1242      81   1452      71    N      0
145268    2016     131   1246      93   1208      80    N      0
145269    2016     131   1272      74   1408      54    N      0
145270    2016     131   1277      64   1268      61    N      0
145271    2016     131   1292      55   1330      53    N      0
145272    2016     131   1314      61   1438      57    N      0
145273    2016     131   1332      88   1428      57    N      0
145274    2016     131   1345      76   1276      59    N      0
145275    2016     131   1371      69   1437      67    N      0
145276    2016     131   1372      82   1394      60    N      0
145277    2016     131   1380      54   1238      53    N      0
145278    2016     131   1386      82   1173      79    N      0
145279    2016     131   1392      80   1436      74    H      0
145280    2016     131   1401      71   1261      38    N      0
145281    2016     131   1419      82   1426      71    N      0
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [52]:
# To know the length of rows and columns -- shape
dp = readCsvData("data.csv")
dp.shape

(145289, 8)

In [54]:
# To know only first few rows -- head()
dp.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [53]:
# To know the last records of the tail -- tail()
dp.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [55]:
# Convert all names into list
dp.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [57]:
# describe() min,max,count,mean

dp.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [58]:
dp.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [59]:
dp["Lteam"].max()   # Max value of one column

1464

In [61]:
dp["Lteam"].min()   # min value of one column

1101

In [62]:
dp["Lteam"].sum()

186386037

In [64]:
# Number of games in each season

dp["Season"].value_counts()

2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: Season, dtype: int64

In [68]:
dp.loc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0

In [66]:
dp.iloc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [69]:
dp.sort_values("Lscore").head()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027    2008      66   1203      49   1387      20    H      0
49310     1997      66   1157      61   1204      21    H      0
89021     2006      44   1284      41   1343      21    A      0
85042     2005      66   1131      73   1216      22    H      0
103660    2009      26   1326      59   1359      22    H      0

In [70]:
dp.sort_values("Lscore").tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
77873    2003     110   1383     142   1254     140    H      2
24970    1991      68   1258     186   1109     140    H      0
22074    1990      96   1261     148   1258     141    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0

In [80]:
# Filter the rows based on the condition

dp[dp["Wscore"]>170]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0

In [83]:
# Filter rows based on 2 conditions

dp[(dp["Wscore"] > 170) & (dp["Daynum"] > 60)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
24970    1991      68   1258     186   1109     140    H      0

In [84]:
 list(map((lambda x:x**2), filter((lambda x:x%2==0), range(10))))

[0, 4, 16, 36, 64]

In [85]:
print([i+j for i in "abc" for j in "def"])

['ad', 'ae', 'af', 'bd', 'be', 'bf', 'cd', 'ce', 'cf']

In [87]:
my_string = "abcdei"
k = [print(i) for i in my_string if i not in "aeiou"]

b
c
d